Repository: capiorg/backend
Catalog: app/i18n/translations/*/LC_MESSAGES/messages.po
Languages: ru_ru

source: field required
ru_ru: обязательное поле

source: extra fields not permitted
ru_ru: лишние поля не допускаются

source: none is not an allowed value
ru_ru: none не является допустимым значением

source: value is not none
ru_ru: значение не none

source: value is not None
ru_ru: значение не None

source: value could not be parsed to a boolean
ru_ru: значение не может быть преобразовано в логическое значение

source: byte type expected
ru_ru: ожидался тип байтов

source: value is not a valid dict
ru_ru: значение не является словарем

source: value is not a valid email address
ru_ru: значение не является электронной почтой

source: invalid or missing URL scheme
ru_ru: схема URL является недопустимой/отсутствующей

source: URL scheme not permitted
ru_ru: URL схема запрещена

source: userinfo required in URL but missing
ru_ru: информация о пользователе требуется в URL, но отсутствует

source: URL host invalid
ru_ru: URL хоста недействителен

source: URL host invalid, top level domain required
ru_ru: URL хоста недействителен, требуется домен верхнего уровня

source: URL port invalid, port cannot exceed 65535
ru_ru: Порт URL-адреса недействителен, порт не может превышать 65535

source: URL invalid, extra characters found after valid URL: {}
ru_ru: URL-адрес недействителен, после действительного URL-адреса обнаружены лишние символы: {}

source: {} is not a valid Enum instance
ru_ru: {} не является допустимым экземпляром Enum

source: {} is not a valid IntEnum instance
ru_ru: {} не является допустимым экземпляром IntEnum

source: value is not a valid integer
ru_ru: значение не является допустимым целым числом

source: value is not a valid float
ru_ru: значение не является допустимым числом с плавающей запятой

source: value is not a valid path
ru_ru: значение не является допустимым путем

source: file or directory at path "{}" does not exist
ru_ru: файл или каталог по пути "{}" не существует

source: path "{}" does not point to a file
ru_ru: путь "{}" не указывает на файл

source: path "{}" does not point to a directory
ru_ru: путь "{}" не указывает на каталог

source: ensure this value contains valid import path or valid callable: {}
ru_ru: убедитесь, что это значение содержит допустимый путь импорта или допустимый вызываемый объект: {}

source: value is not a valid sequence
ru_ru: значение не является допустимой последовательностью

source: value is not a valid list
ru_ru: значение не является допустимым списком

source: value is not a valid set
ru_ru: значение не является допустимым множеством

source: value is not a valid frozenset
ru_ru: значение не является допустимым неизменяемым множеством

source: value is not a valid tuple
ru_ru: значение не является допустимым кортежем

source: wrong tuple length {}
ru_ru: неправильная длина кортежа {}

source: ensure this value has at least {} items
ru_ru: убедитесь, что это значение содержит не менее {} элементов

source: ensure this value has at most {} items
ru_ru: убедитесь, что это значение содержит не более {} элементов

source: the list has duplicated items
ru_ru: в списке есть повторяющиеся элементы

source: ensure this value has at least {} characters
ru_ru: убедитесь, что это значение содержит не менее {} символов

source: ensure this value has at most {} characters
ru_ru: убедитесь, что это значение содержит не более {} символов

source: str type expected
ru_ru: ожидаемый тип - строка

source: string does not match regex "{}"
ru_ru: строка не соответствует регулярному выражению "{}"

source: ensure this value is greater than {}
ru_ru: убедитесь, что это значение больше {}

source: ensure this value is greater than or equal to {}
ru_ru: убедитесь, что это значение больше или равно {}

source: ensure this value is less than {}
ru_ru: убедитесь, что это значение меньше {}

source: ensure this value is less than or equal to {}
ru_ru: убедитесь, что это значение меньше или равно {}

source: ensure this value is a multiple of {}
ru_ru: убедитесь, что это значение кратно {}

source: value is not a valid decimal
ru_ru: значение не является допустимым десятичным числом

source: ensure that there are no more than {} digits in total
ru_ru: убедитесь, что всего не более {} цифр

source: ensure that there are no more than {} decimal places
ru_ru: убедитесь, что не более {} знаков после запятой

source: ensure that there are no more than {} digits before the decimal point
ru_ru: убедитесь, что до десятичной точки не более {} цифр

source: invalid datetime format
ru_ru: неверный формат даты и времени

source: invalid date format
ru_ru: неверный формат даты

source: date is not in the past
ru_ru: дата не может быть в прошлом

source: date is not in the future
ru_ru: дата не может быть в будущем

source: invalid time format
ru_ru: неверный формат времени

source: invalid duration format
ru_ru: неверный формат отрезка времени

source: value is not a valid hashable
ru_ru: значение не является допустимым хэшем

source: value is not a valid uuid
ru_ru: значение не является допустимым UUID

source: uuid version {} expected
ru_ru: ожидается версия uuid {}

source: instance of {} expected
ru_ru: ожидается экземпляр {}

source: a class is expected
ru_ru: ожидается класс

source: subclass of {} expected
ru_ru: ожидается подкласс {}

source: Invalid JSON
ru_ru: Неверный JSON

source: JSON object must be str, bytes or bytearray
ru_ru: Объект JSON должен быть str, bytes или bytearray

source: Invalid regular expression
ru_ru: Недопустимое регулярное выражение

source: instance of {}, tuple or dict expected
ru_ru: ожидается экземпляр {}, кортеж или словарь

source: {} is not callable
ru_ru: {} не вызывается

source: value is not a valid IPv4 or IPv6 address
ru_ru: значение не является допустимым адресом IPv4 или IPv6

source: value is not a valid IPv4 or IPv6 interface
ru_ru: значение не является допустимым интерфейсом IPv4 или IPv6

source: value is not a valid IPv4 or IPv6 network
ru_ru: значение не является допустимой сетью IPv4 или IPv6

source: value is not a valid IPv4 address
ru_ru: значение не является действительным адресом IPv4

source: value is not a valid IPv6 address
ru_ru: значение не является действительным адресом IPv6

source: value is not a valid IPv4 network
ru_ru: значение не является допустимой сетью IPv4

source: value is not a valid IPv6 network
ru_ru: значение не является допустимой сетью IPv6

source: value is not a valid IPv4 interface
ru_ru: значение не является допустимым интерфейсом IPv4

source: value is not a valid IPv6 interface
ru_ru: значение не является допустимым интерфейсом IPv6

source: value is not a valid color: {}
ru_ru: значение не является допустимым цветом: {}

source: value is not a valid boolean
ru_ru: значение не является допустимым логическим значением

source: card number is not all digits
ru_ru: номер карты не состоит из цифр

source: card number is not luhn valid
ru_ru: номер карты недействителен

source: Length for a {}
ru_ru: Длина для {}

source: could not parse value and unit from byte string
ru_ru: не удалось разобрать значение и единицу измерения из байтовой строки

source: could not interpret byte unit: {}
ru_ru: не удалось интерпретировать байтовую единицу: {}

source: Discriminator {} is missing in value
ru_ru: Дискриминатор {} отсутствует в значении

source: No match for discriminator {}
ru_ru: Не соответствует дискриминатору {}
